yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/FaceLandmark/main.cpp
/**************************************************************************//**
 * @file     main.cpp
 * @version  V1.00
 * @brief    face landmark network sample. Demonstrate face landmark detect.
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2024 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/

#include "BoardInit.hpp"      /* Board initialisation */
#include "log_macros.h"      /* Logging macros (optional) */

#include "BufAttributes.hpp" /* Buffer attributes to be applied */
#include "FaceLandmarkModel.hpp"       /* Model API */
#include "FaceDetectionModel.hpp"       /* Model API */
#include "FaceLandmarkPostProcessing.hpp"
#include "FaceDetectorPostProcessing.hpp"

#include "imlib.h"          /* Image processing */
#include "framebuffer.h"
#include <cmath>
#include "ModelFileReader.h"
#include "ff.h"

#undef PI /* PI macro conflict with CMSIS/DSP */
#include "NuMicro.h"

//#define __PROFILE__
#define __USE_DISPLAY__
//#define __USE_UVC__

#if defined (FACE_LANDMARK_ATTENTION_MODEL)
#define __LOAD_MODEL_FROM_SD__
#endif

#include "Profiler.hpp"

#include "ImageSensor.h"

#if defined (__USE_DISPLAY__)
    #include "Display.h"
#endif

#if defined (__USE_UVC__)
    #include "UVC.h"
#endif

#define NUM_FRAMEBUF 2  //1 or 2
#define MODEL_AT_HYPERRAM_ADDR (0x82400000)
#define FACE_PRESENCE_THRESHOLD  				(0.4)

/* Speaking detection - tightened to fix "always speaking" */
#define SPEAKING_VELOCITY_THRESHOLD				(2.0f)   /* Lip movement (px/frame). Higher = less sensitive */
#define SPEAKING_SMOOTHING_FRAMES				(3)       /* Frames above threshold to trigger */
#define SPEAKING_RELEASE_FRAMES					(5)       /* Hysteresis: frames below before releasing */
#define MAR_SPEAKING_THRESHOLD  (0.18f)  /* Mouth opening. Higher = less sensitive. Require BOTH for reliability. */

/* Lip offset: if landmarks appear shifted bottom-left, shift them up-right. Tune per camera/model. */
#define LIP_OFFSET_X  (4)   /* Pixels to shift right (positive = correct bottom-left shift) */
#define LIP_OFFSET_Y  (6)   /* Pixels to shift up (positive = correct bottom-left shift) */

/* Lip indices: doubled for finer coverage - full outer + inner mouth contour (~24 points) */
#define LIP_LANDMARK_NUM		(24)
static const int s_i32LipLandmarkIndices[LIP_LANDMARK_NUM] = {
	/* Outer lip contour (clockwise from right corner) */
	61, 146, 91, 181, 84, 17, 314, 405, 321, 375, 291, 185, 40, 39, 37, 0, 267, 269, 270, 409,
	/* Inner lip - key points for mouth opening */
	78, 308, 87, 14
};

typedef enum
{
    eFRAMEBUF_EMPTY,
    eFRAMEBUF_FULL,
    eFRAMEBUF_INF
} E_FRAMEBUF_STATE;

typedef struct
{
    E_FRAMEBUF_STATE eState;
    image_t frameImage;
    std::vector<arm::app::face_landmark::KeypointResult> results_KP;
    std::vector<arm::app::face_detection::DetectionResult> results_FD;
    std::vector<bool> isSpeaking;   /* Per-face speaking state */
} S_FRAMEBUF;

/* Previous lip positions for velocity-based speaking detection */
#define MAX_TRACKED_FACES  5
typedef struct {
    float lipX[LIP_LANDMARK_NUM];
    float lipY[LIP_LANDMARK_NUM];
    int x0, y0, w, h;  /* Face box for matching */
    int valid;
} S_PREV_LIP_STATE;
static S_PREV_LIP_STATE s_asPrevLipState[MAX_TRACKED_FACES];
static int s_i32SpeakingConfirmCount[MAX_TRACKED_FACES];
static int s_i32SpeakingReleaseCount[MAX_TRACKED_FACES];  /* Hysteresis: delay before releasing */

S_FRAMEBUF s_asFramebuf[NUM_FRAMEBUF];

namespace arm
{
namespace app
{
/* Tensor arena buffer */
#undef ACTIVATION_BUF_SZ
#if defined(FACE_LANDMARK_ATTENTION_MODEL)
#define FACE_LANDMARK_ACTIVATION_BUF_SZ	 (500000)
#else
#define FACE_LANDMARK_ACTIVATION_BUF_SZ	 (460000)
#endif
#define FACE_DETECTION_ACTIVATION_BUF_SZ (460000)
static uint8_t tensorArena_FaceLandmark[FACE_LANDMARK_ACTIVATION_BUF_SZ] ACTIVATION_BUF_ATTRIBUTE;
static uint8_t tensorArena_FaceDetection[FACE_DETECTION_ACTIVATION_BUF_SZ] ACTIVATION_BUF_ATTRIBUTE;

#if !defined(__LOAD_MODEL_FROM_SD__)
/* Optional getter function for the model pointer and its size. */
namespace face_landmark
{
extern uint8_t *GetModelPointer();
extern size_t GetModelLen();
} /* namespace face_landmark */

namespace face_detection
{
extern uint8_t *GetModelPointer();
extern size_t GetModelLen();
} /* namespace face_detection */

#endif

} /* namespace app */
} /* namespace arm */

//frame buffer managemnet function
static S_FRAMEBUF *get_empty_framebuf()
{
    int i;

    for (i = 0; i < NUM_FRAMEBUF; i ++)
    {
        if (s_asFramebuf[i].eState == eFRAMEBUF_EMPTY)
            return &s_asFramebuf[i];
    }

    return NULL;
}

static S_FRAMEBUF *get_full_framebuf()
{
    int i;

    for (i = 0; i < NUM_FRAMEBUF; i ++)
    {
        if (s_asFramebuf[i].eState == eFRAMEBUF_FULL)
            return &s_asFramebuf[i];
    }

    return NULL;
}

static S_FRAMEBUF *get_inf_framebuf()
{
    int i;

    for (i = 0; i < NUM_FRAMEBUF; i ++)
    {
        if (s_asFramebuf[i].eState == eFRAMEBUF_INF)
            return &s_asFramebuf[i];
    }

    return NULL;
}

#define IMAGE_DISP_UPSCALE_FACTOR 1
#if defined(LT7381_LCD_PANEL)
#define FONT_DISP_UPSCALE_FACTOR 2
#else
#define FONT_DISP_UPSCALE_FACTOR 1
#endif

/* Image processing initiate function */
//Used by omv library
#if defined(__USE_UVC__)
//UVC only support QVGA, QQVGA
#define GLCD_WIDTH	320
#define GLCD_HEIGHT	240
#else
#define GLCD_WIDTH	240
#define GLCD_HEIGHT	240
#endif

#define IMAGE_FB_SIZE	(GLCD_WIDTH * GLCD_HEIGHT * 2)

#undef OMV_FB_SIZE
#define OMV_FB_SIZE (IMAGE_FB_SIZE + 1024)

#undef OMV_FB_ALLOC_SIZE
#define OMV_FB_ALLOC_SIZE	(1*1024)

__attribute__((section(".bss.vram.data"), aligned(32))) static char fb_array[OMV_FB_SIZE + OMV_FB_ALLOC_SIZE];
__attribute__((section(".bss.vram.data"), aligned(32))) static char jpeg_array[OMV_JPEG_BUF_SIZE];

#if (NUM_FRAMEBUF == 2)
    __attribute__((section(".bss.vram.data"), aligned(32))) static char frame_buf1[OMV_FB_SIZE];
#endif

char *_fb_base = NULL;
char *_fb_end = NULL;
char *_jpeg_buf = NULL;
char *_fballoc = NULL;

static void omv_init()
{
    image_t frameBuffer;
    int i;

