yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/FaceLandmark/main.cpp
    frameBuffer.w = GLCD_WIDTH;
    frameBuffer.h = GLCD_HEIGHT;
    frameBuffer.size = GLCD_WIDTH * GLCD_HEIGHT * 2;
    frameBuffer.pixfmt = PIXFORMAT_RGB565;

    _fb_base = fb_array;
    _fb_end =  fb_array + OMV_FB_SIZE - 1;
    _fballoc = _fb_base + OMV_FB_SIZE + OMV_FB_ALLOC_SIZE;
    _jpeg_buf = jpeg_array;

    fb_alloc_init0();

    framebuffer_init0();
    framebuffer_init_from_image(&frameBuffer);

    for (i = 0 ; i < NUM_FRAMEBUF; i++)
    {
        s_asFramebuf[i].eState = eFRAMEBUF_EMPTY;
    }

    framebuffer_init_image(&s_asFramebuf[0].frameImage);

#if (NUM_FRAMEBUF == 2)
    s_asFramebuf[1].frameImage.w = GLCD_WIDTH;
    s_asFramebuf[1].frameImage.h = GLCD_HEIGHT;
    s_asFramebuf[1].frameImage.size = GLCD_WIDTH * GLCD_HEIGHT * 2;
    s_asFramebuf[1].frameImage.pixfmt = PIXFORMAT_RGB565;
    s_asFramebuf[1].frameImage.data = (uint8_t *)frame_buf1;
#endif
}

/* Draw only lip/mouth keypoints - no eyes, cheeks. Apply offset to correct bottom-left shift. */
static void DrawLipLandmark(
    const std::vector<arm::app::face_landmark::KeypointResult> &results,
	int posOffsetX,
	int posOffsetY,
    image_t *drawImg
)
{
	if (results.size() < 468) return;
	int lipColor = COLOR_R5_G6_B5_TO_RGB565(0, COLOR_G6_MAX, 0);  /* Green */
	for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
		int idx = s_i32LipLandmarkIndices[i];
		if (idx < (int)results.size()) {
			const auto &kp = results[idx];
			int drawX = posOffsetX + kp.m_x + LIP_OFFSET_X;   /* Shift right to correct offset */
			int drawY = posOffsetY + kp.m_y - LIP_OFFSET_Y;   /* Shift up to correct offset */
			imlib_draw_circle(drawImg, drawX, drawY, 2, lipColor, 1, true);
		}
	}
}

/* Mouth Aspect Ratio: vertical extent / horizontal extent of lip bbox. High = mouth open (speaking).
 * Uses all lip points for robustness - less affected by model errors on individual points. */
static float ComputeMAR(const std::vector<arm::app::face_landmark::KeypointResult> &results_KP)
{
    if (results_KP.size() < 468) return 0.0f;
    float minX = 1e9f, maxX = -1e9f, minY = 1e9f, maxY = -1e9f;
    for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
        int idx = s_i32LipLandmarkIndices[i];
        if (idx >= (int)results_KP.size()) continue;
        float x = (float)results_KP[idx].m_x, y = (float)results_KP[idx].m_y;
        if (x < minX) minX = x;  if (x > maxX) maxX = x;
        if (y < minY) minY = y;  if (y > maxY) maxY = y;
    }
    float horiz = maxX - minX;
    float vert = maxY - minY;
    if (horiz < 2.0f) return 0.0f;
    return vert / horiz;
}

/* Compute lip keypoint velocity (avg movement) using matched previous face */
static float ComputeLipVelocity(
    const std::vector<arm::app::face_landmark::KeypointResult> &results_KP,
    int prevFaceIdx,
    int posOffsetX,
    int posOffsetY
)
{
    float velocity = 0.0f;
    int validPoints = 0;

    if (results_KP.size() < 468 || prevFaceIdx < 0 || prevFaceIdx >= MAX_TRACKED_FACES || !s_asPrevLipState[prevFaceIdx].valid)
        return 0.0f;

    for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
        int idx = s_i32LipLandmarkIndices[i];
        if (idx >= (int)results_KP.size()) continue;

        float curX = posOffsetX + results_KP[idx].m_x;
        float curY = posOffsetY + results_KP[idx].m_y;
        float dx = curX - s_asPrevLipState[prevFaceIdx].lipX[i];
        float dy = curY - s_asPrevLipState[prevFaceIdx].lipY[i];
        velocity += (float)std::sqrt(dx*dx + dy*dy);
        validPoints++;
    }
    return (validPoints > 0) ? (velocity / validPoints) : 0.0f;
}

/* Find best-matching previous face by bbox center distance (for face order changes) */
static int FindMatchingPrevFace(int curX0, int curY0, int curW, int curH)
{
    int bestIdx = -1;
    float bestDist = 1e9f;
    int curCx = curX0 + curW / 2;
    int curCy = curY0 + curH / 2;

    for (int j = 0; j < MAX_TRACKED_FACES; j++) {
        if (!s_asPrevLipState[j].valid) continue;
        int prevCx = s_asPrevLipState[j].x0 + s_asPrevLipState[j].w / 2;
        int prevCy = s_asPrevLipState[j].y0 + s_asPrevLipState[j].h / 2;
        float dx = (float)(curCx - prevCx);
        float dy = (float)(curCy - prevCy);
        float dist = std::sqrt(dx*dx + dy*dy);
        if (dist < bestDist && dist < (float)(curW + curH)) {  /* Allow face to move within ~2x face size */
            bestDist = dist;
            bestIdx = j;
        }
    }
    return bestIdx;
}

/* Store current lip positions for next frame's velocity computation */
static void StoreLipPositions(
    const std::vector<arm::app::face_landmark::KeypointResult> &results_KP,
    int storeIdx,
    int posOffsetX,
    int posOffsetY,
    int faceX0, int faceY0, int faceW, int faceH
)
{
    if (storeIdx >= MAX_TRACKED_FACES || storeIdx < 0 || results_KP.size() < 468) return;

    for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
        int idx = s_i32LipLandmarkIndices[i];
        if (idx < (int)results_KP.size()) {
            s_asPrevLipState[storeIdx].lipX[i] = posOffsetX + results_KP[idx].m_x;
            s_asPrevLipState[storeIdx].lipY[i] = posOffsetY + results_KP[idx].m_y;
        }
    }
    s_asPrevLipState[storeIdx].x0 = faceX0;
    s_asPrevLipState[storeIdx].y0 = faceY0;
    s_asPrevLipState[storeIdx].w = faceW;
    s_asPrevLipState[storeIdx].h = faceH;
    s_asPrevLipState[storeIdx].valid = 1;
}

static void DrawDetectFace(
    std::vector<arm::app::face_detection::DetectionResult> &results,
    std::vector<bool> &isSpeaking,
    image_t *drawImg
)
{
	arm::app::face_detection::DetectionResult faceBox;
	int faceBoxSize = results.size();
	
	for(int i = 0; i < faceBoxSize; i ++)
	{
		faceBox = results[i];
		/* Green when speaking, blue otherwise */
		int boxColor = (i < (int)isSpeaking.size() && isSpeaking[i])
			? COLOR_R5_G6_B5_TO_RGB565(0, COLOR_G6_MAX, 0)  /* Green */
			: COLOR_B5_MAX;  /* Blue */
		imlib_draw_rectangle(drawImg, faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h, boxColor, 2, false);
		/* Draw "Speaking" label when speaking */
		if (i < (int)isSpeaking.size() && isSpeaking[i]) {
			imlib_draw_string(drawImg, faceBox.m_x0, faceBox.m_y0 - 14, "Speaking", COLOR_R5_G6_B5_TO_RGB565(0, COLOR_G6_MAX, 0), 1, 0, 0, false, 0, false, false, 0, false, false);
		}
	}
}

