yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/FaceLandmark/main.cpp
static void DetectFaceRegion(
    S_FRAMEBUF *infFramebuf,
    arm::app::FaceDetectionModel *faceDetectionModel,	
	arm::app::FaceDetectorPostProcess *postProcess,
	arm::app::Profiler *profiler
)
{
    TfLiteIntArray *inputShape = faceDetectionModel->GetInputShape(0);
    TfLiteTensor *inputTensor   = faceDetectionModel->GetInputTensor(0);
    rectangle_t roi;

    const int inputImgCols = inputShape->data[arm::app::FaceDetectionModel::ms_inputColsIdx];
    const int inputImgRows = inputShape->data[arm::app::FaceDetectionModel::ms_inputRowsIdx];

	uint64_t u64StartCycle;
	uint64_t u64EndCycle;

	auto *req_data = static_cast<uint8_t *>(inputTensor->data.data);
	auto *signed_req_data = static_cast<int8_t *>(inputTensor->data.data);

    arm::app::QuantParams inQuantParams = arm::app::GetTensorQuantParams(inputTensor);
	
	//resize full image to input tensor
	image_t resizeImg;

	roi.x = 0;
	roi.y = 0;
	roi.w = infFramebuf->frameImage.w;
	roi.h = infFramebuf->frameImage.h;

	resizeImg.w = inputImgCols;
	resizeImg.h = inputImgRows;
	resizeImg.data = (uint8_t *)inputTensor->data.data; //direct resize to input tensor buffer
	resizeImg.pixfmt = PIXFORMAT_GRAYSCALE;

	if(profiler)
		u64StartCycle = pmu_get_systick_Count();

	imlib_nvt_scale(&infFramebuf->frameImage, &resizeImg, &roi);

	if(profiler){
		u64EndCycle = pmu_get_systick_Count();
		info("face detect resize cycles %llu \n", (u64EndCycle - u64StartCycle));
	}

	if(profiler){
		u64StartCycle = pmu_get_systick_Count();
	}
		
    /* face landmark/detection model preprocessing is image conversion from uint8 to [0,1] float values,
     * then quantize them with input quantization info. */
	for (size_t i = 0; i < inputTensor->bytes; i++)
	{
//		auto i_data_int8 = static_cast<int8_t>(((static_cast<float>(req_data[i]) / 255.0f) / inQuantParams.scale) + inQuantParams.offset);
//		signed_req_data[i] = std::min<int8_t>(INT8_MAX, std::max<int8_t>(i_data_int8, INT8_MIN));
		signed_req_data[i] = static_cast<int8_t>(req_data[i]) - 128;
	}

	if(profiler){
		u64EndCycle = pmu_get_systick_Count();
		info("face detect quantize cycles %llu \n", (u64EndCycle - u64StartCycle));
	}

	if(profiler){
		profiler->StartProfiling("Inference");
	}

	faceDetectionModel->RunInference();

	if(profiler){
		profiler->StopProfiling();
		profiler->PrintProfilingResult();
	}

	if(profiler){
		u64StartCycle = pmu_get_systick_Count();
	}
	
	postProcess->RunPostProcess(infFramebuf->results_FD);

	if(profiler){
		u64EndCycle = pmu_get_systick_Count();
		info("face detect post processing cycles %llu \n", (u64EndCycle - u64StartCycle));
	}

	float scaleFactoryW = 1.4;
	float scaleFactoryH = 1.4;
	arm::app::face_detection::DetectionResult *faceBox;
	//fine tune face region
	for(int i = 0 ; i < infFramebuf->results_FD.size(); i ++)
	{
		float scaleW;
		float scaleH;
		int newX;
		int newY;
		
		int newW;
		int newH;

		faceBox = &(infFramebuf->results_FD[i]);
	
		scaleH = scaleFactoryH * faceBox->m_h;
//		scaleW = scaleFactoryW * faceBox->m_w;
		scaleW = scaleH;
		newW = scaleW;
		newH = scaleH;

		newX = faceBox->m_x0 - ((scaleW - faceBox->m_w) / 2);
		newY = faceBox->m_y0 - ((scaleH - faceBox->m_h) / 2);
		
		if(newX < 0)
			newX = 0;
		
		if(newY < 0)
			newY = 0;

		if(newX + newW >= infFramebuf->frameImage.w)
			newW = infFramebuf->frameImage.w - newX;
		
		if(newY + newH >= infFramebuf->frameImage.h)
			newH = infFramebuf->frameImage.h - newY;

		faceBox->m_x0 = newX;
		faceBox->m_y0 = newY;
		faceBox->m_w = newW;
		faceBox->m_h = newH;
	}
}

static void DetectFaceLandmark_DrawResult(
    S_FRAMEBUF *infFramebuf,
    arm::app::FaceLandmarkModel *faceLandmarkModel,	
	arm::app::face_landmark::FaceLandmarkPostProcessing *postProcess,
	arm::app::Profiler *profiler
)
{
	int i;
	arm::app::face_detection::DetectionResult faceBox;
    rectangle_t roi;
    TfLiteIntArray *inputShape = faceLandmarkModel->GetInputShape(0);
    TfLiteTensor *inputTensor   = faceLandmarkModel->GetInputTensor(0);

    const int inputImgCols = inputShape->data[arm::app::FaceLandmarkModel::ms_inputColsIdx];
    const int inputImgRows = inputShape->data[arm::app::FaceLandmarkModel::ms_inputRowsIdx];

	uint64_t u64StartCycle;
	uint64_t u64EndCycle;

	//Quantize input tensor data
	auto *req_data = static_cast<uint8_t *>(inputTensor->data.data);
	auto *signed_req_data = static_cast<int8_t *>(inputTensor->data.data);

    arm::app::QuantParams inQuantParams = arm::app::GetTensorQuantParams(inputTensor);

	TfLiteTensor *modelOutput0 = faceLandmarkModel->GetOutputTensor(FACE_LANDMARK_MESH_TENSOR_INDEX);

	#if defined(FACE_LANDMARK_LEFT_IRIS_TENSOR_INDEX)
		TfLiteTensor *modelOutput1 = faceLandmarkModel->GetOutputTensor(FACE_LANDMARK_LEFT_IRIS_TENSOR_INDEX);
	#else
		TfLiteTensor *modelOutput1 = NULL;
	#endif

	#if defined(FACE_LANDMARK_RIGHT_IRIS_TENSOR_INDEX)
		TfLiteTensor *modelOutput2 = faceLandmarkModel->GetOutputTensor(FACE_LANDMARK_RIGHT_IRIS_TENSOR_INDEX);			
	#else
		TfLiteTensor *modelOutput2 = NULL;
	#endif

	TfLiteTensor *modelOutput3 = faceLandmarkModel->GetOutputTensor(FACE_LANDMARK_FACE_FLAG_TENSOR_INDEX);

	/* Resize speaking state to match face count */
	infFramebuf->isSpeaking.resize(infFramebuf->results_FD.size(), false);
	
	for(i = 0 ; i < infFramebuf->results_FD.size(); i ++)
	{
		faceBox = infFramebuf->results_FD[i];

		//resize face region image to input tensor
		image_t resizeImg;

		roi.x = faceBox.m_x0;
		roi.y = faceBox.m_y0;
		roi.w = faceBox.m_w;
		roi.h = faceBox.m_h;

		resizeImg.w = inputImgCols;
		resizeImg.h = inputImgRows;
		resizeImg.data = (uint8_t *)inputTensor->data.data; //direct resize to input tensor buffer
		resizeImg.pixfmt = PIXFORMAT_RGB888;

		if(profiler)
			u64StartCycle = pmu_get_systick_Count();

        imlib_nvt_scale(&infFramebuf->frameImage, &resizeImg, &roi);

		if(profiler){
			u64EndCycle = pmu_get_systick_Count();
			info("face landmark resize cycles %llu \n", (u64EndCycle - u64StartCycle));
		}
			
		if(profiler){
			u64StartCycle = pmu_get_systick_Count();
		}
			
		/* face landmark/detection model preprocessing is image conversion from uint8 to [0,1] float values,
		* then quantize them with input quantization info. */
		for (size_t i = 0; i < inputTensor->bytes; i++)
		{
//			auto i_data_int8 = static_cast<int8_t>(((static_cast<float>(req_data[i]) / 255.0f) / inQuantParams.scale) + inQuantParams.offset);
//			signed_req_data[i] = std::min<int8_t>(INT8_MAX, std::max<int8_t>(i_data_int8, INT8_MIN));
			signed_req_data[i] = static_cast<int8_t>(req_data[i]) - 128;
		}

		if(profiler){
			u64EndCycle = pmu_get_systick_Count();
			info("face landmark quantize cycles %llu \n", (u64EndCycle - u64StartCycle));
		}

		if(profiler){
			profiler->StartProfiling("Inference");
		}

		faceLandmarkModel->RunInference();

		if(profiler){
			profiler->StopProfiling();
			profiler->PrintProfilingResult();
		}

		if(profiler){
			u64StartCycle = pmu_get_systick_Count();
		}

		postProcess->RunPostProcessing(
			inputImgCols,
			inputImgRows,
			roi.w,
			roi.h,
			modelOutput0,
			modelOutput1,
			modelOutput2,
			modelOutput3,
			infFramebuf->results_KP);

		if(profiler){
			u64EndCycle = pmu_get_systick_Count();
			info("face landmark post processing cycles %llu \n", (u64EndCycle - u64StartCycle));
		}

